In [1]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import matplotlib
import pandas as pd
import numpy as np
import requests
from wordcloud import WordCloud, STOPWORDS
from scipy.stats import linregress
import scipy.stats as st

In [2]:
# Read in csv
file1 = "data/Birth and Fertility Rate 2016 - 2019.csv"
file2 = "data/MomCharacteristics 2016 - 2019.csv"
file3 = "data/Infant Characteristics 2016 - 2019.csv"
file4 = 'data/fertility info on mom 2016 - 2019.csv'
file5 = "data/birthrate info on mom 2016 - 2019.csv"

# Clean Data

In [32]:
mom_info = pd.read_csv(file4)

mom_info.head()

,state,year,race,age,births,femalepop,fertilityrate
0,Alabama,2016,American Indian or Alaska Native,15-19 years,14,1211.0,11.56
1,Alabama,2016,American Indian or Alaska Native,20-24 years,50,1184.0,42.23
2,Alabama,2016,American Indian or Alaska Native,25-29 years,34,1127.0,30.17
3,Alabama,2016,American Indian or Alaska Native,30-34 years,21,1179.0,17.81
4,Alabama,2016,American Indian or Alaska Native,35-39 years,12,1184.0,10.14

In [16]:
birth = pd.read_csv(file1)

birth.head()

     state              county    year  births      birthrate  fertilityrate
0  Alabama  Baldwin County, AL  2016.0    2247          10.77           61.3
1  Alabama  Baldwin County, AL  2017.0    2322          10.92          62.42
2  Alabama  Baldwin County, AL  2018.0    2290  Not Available  Not Available
3  Alabama  Baldwin County, AL  2019.0    2329  Not Available  Not Available
4  Alabama  Baldwin County, AL     NaN    9188          21.81         124.41

In [25]:
mom = pd.read_csv(file2)
mom.head()

,state,year,race,age,education,births
0,Alabama,2016,American Indian or Alaska Native,20-24 years,9th through 12th grade with no diploma,10
1,Alabama,2016,American Indian or Alaska Native,20-24 years,High school graduate or GED completed,19
2,Alabama,2016,American Indian or Alaska Native,20-24 years,"Some college credit, but not a degree",12
3,Alabama,2016,American Indian or Alaska Native,25-29 years,High school graduate or GED completed,18
4,Alabama,2016,American Indian or Alaska Native,25-29 years,"Some college credit, but not a degree",10

In [6]:
infants = pd.read_csv(file3)
infants.head()

     state  year     sex pluarlity             age  births
0  Alabama  2016  Female    Single  Under 15 years      20
1  Alabama  2016  Female    Single     15-19 years    2086
2  Alabama  2016  Female    Single     20-24 years    7610
3  Alabama  2016  Female    Single     25-29 years    8712
4  Alabama  2016  Female    Single     30-34 years    6264

In [7]:
mom_birthrate = pd.read_csv(file5)
mom_birthrate.head()

,state,year,race,births,totalpop,birthrate
0,Alabama,2016.0,American Indian or Alaska Native,133,33932,3.92
1,Alabama,2016.0,Asian,1041,68864,15.12
2,Alabama,2016.0,Black or African American,18181,1303516,13.95
3,Alabama,2016.0,Native Hawaiian or Other Pacific Islander,143,5068,28.22
4,Alabama,2016.0,White,38778,3372524,11.50

# Extract and Load into Postgres(Heroku)

In [34]:
#import necessary modules
import datetime as dt
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy.sql import text

from flask import Flask, jsonify

connection_string = "postgres://mpiljlhpdduyfa:2332f5bec0021e7c8a94d4f2450748ccf8aeaf1a965c62cc3d3885a838a5e316@ec2-52-22-238-188.compute-1.amazonaws.com:5432/d29t1m9qk328vp"
engine = create_engine(f'{connection_string}')

In [58]:
mom_information = '''
    create table mom_info(
    state varchar(100) PRIMARY KEY,     
    year integer,  
    race varchar(200),
    age varchar(100),
    births integer,
    femalepop decimal,
    fertilityrate integer
    )
'''

births = '''
    create table births(
     state varchar(100) PRIMARY KEY,  
    county varchar (200),
    year integer, 
    births integer, 
   birthrate decimal,
    fertilityrate decimal  
    )
'''

infants = '''
    create table infants( 
     state varchar(100) PRIMARY KEY,   
    year integer, 
    sex varchar (100),
    pluarity varchar (100),
    age integer,
    births integer
    )
   '''

total = '''
    create table total( 
    state varchar(100) PRIMARY KEY,  
    year integer, 
    race varchar (200),
    births integer,
    birthrate decimal
   )
'''

education = '''
    create table education( 
    state varchar(100) PRIMARY KEY,  
    year integer, 
    race varchar (200),
    age integer,
    education varchar(500),
    births integer
   )
'''

In [59]:
tables = {'mom_information' : mom_information.strip(),
          'births' : births.strip(),
          'infants' : infants.strip(),
          'total' : total.strip(),
          'education' : education.strip()
         }

In [60]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table mom_information if it already exists...
dropping the table births if it already exists...
dropping the table infants if it already exists...
dropping the table total if it already exists...
dropping the table education if it already exists...

In [61]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table mom_information...
creating the table births...
creating the table infants...
creating the table total...
creating the table education...

In [62]:
mom_info.to_sql(name='mom_information', con=engine, if_exists='append', index=False)

In [ ]:
%matplotlib inline
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt